app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      begin
        artist = Artist.find(params[:artist_id])
        @songs = artist.songs
      rescue ActiveRecord::RecordNotFound
        redirect_to artists_path, alert: "Artist not found"
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    if params[:artist_id]
      begin
        artist = Artist.find_by(id: params[:artist_id])
        @song = artist.songs.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1222], ["LIMIT", 1]]